
/**
 * 中文说明
 */
export enum CHSNAME
{
	BAD = '錯字',
	D_A = '形容词 形语素',
	D_B = '区别词 区别语素',
	D_C = '连词 连语素',
	D_D = '副词 副语素',
	D_E = '叹词 叹语素',
	D_F = '方位词 方位语素',
	D_I = '成语',
	D_L = '习语',
	A_M = '数词 数语素',
	D_MQ = '数量词',
	D_N = '名词 名语素',
	D_O = '拟声词',
	D_P = '介词',
	A_Q = '量词 量语素',
	D_R = '代词 代语素',
	D_S = '处所词',
	D_T = '时间词',
	D_U = '助词 助语素',
	D_V = '动词 动语素',
	D_W = '标点符号',
	D_X = '非语素字',
	D_Y = '语气词 语气语素',
	D_Z = '状态词',
	A_NR = '人名',
	A_NS = '地名',
	A_NT = '机构团体',
	A_NX = '外文字符',
	A_NZ = '其他专名',
	D_ZH = '前接成分',
	D_K = '后接成分',
	URL = '网址 邮箱地址',
	UNK = '未知',
}

export default CHSNAME
