
/**
 * 繁體中文说明
 */
export enum ZHNAME
{
	BAD = '錯字',
	D_A = '形容詞 形語素',
	D_B = '區別詞 區別語素',
	D_C = '連詞 連語素',
	D_D = '副詞 副語素',
	D_E = '嘆詞 嘆語素',
	D_F = '方位詞 方位語素',
	D_I = '成語',
	D_L = '習語',
	A_M = '數詞 數語素',
	D_MQ = '數量詞',
	D_N = '名詞 名語素',
	D_O = '擬聲詞',
	D_P = '介詞',
	A_Q = '量詞 量語素',
	D_R = '代詞 代語素',
	D_S = '處所詞',
	D_T = '時間詞',
	D_U = '助詞 助語素',
	D_V = '動詞 動語素',
	D_W = '標點符號',
	D_X = '非語素字',
	D_Y = '語氣詞 語氣語素',
	D_Z = '狀態詞',
	A_NR = '人名',
	A_NS = '地名',
	A_NT = '機構團體',
	A_NX = '外文字符',
	A_NZ = '其他專名',
	D_ZH = '前接成分',
	D_K = '後接成分',
	URL = '網址 郵箱地址',
	UNK = '未知',
}

export default ZHNAME
