
/**
 * 单词类型
 */
export enum POSTAG
{

	/**
	 * 錯字
	 */
	BAD = 0x80000000,
	/**
	 * 形容词 形语素
	 */
	D_A = 0x40000000,
	/**
	 * 区别词 区别语素
	 */
	D_B = 0x20000000,
	/**
	 * 连词 连语素
	 */
	D_C = 0x10000000,

	// ---

	/**
	 * 副词 副语素
	 */
	D_D = 0x08000000,
	/**
	 * 叹词 叹语素
	 */
	D_E = 0x04000000,
	/**
	 * 方位词 方位语素
	 */
	D_F = 0x02000000,
	/**
	 * 成语
	 */
	D_I = 0x01000000,

	// ---

	/**
	 * 习语
	 * 類似成語或者曖昧無法分明的用語
	 */
	D_L = 0x00800000,
	/**
	 * 数词 数语素
	 * 可以與其他數詞或者量詞合併的詞
	 */
	A_M = 0x00400000,
	/**
	 * 数量词
	 */
	D_MQ = 0x00200000,
	/**
	 * 名词 名语素
	 */
	D_N = 0x00100000,

	// ---

	/**
	 * 拟声词
	 */
	D_O = 0x00080000,
	/**
	 * 介词
	 */
	D_P = 0x00040000,
	/**
	 * 量词 量语素
	 * 可以與數詞合併的詞
	 */
	A_Q = 0x00020000,
	/**
	 * 代词 代语素
	 */
	D_R = 0x00010000,

	// ---

	/**
	 * 处所词
	 */
	D_S = 0x00008000,
	/**
	 * 时间词
	 */
	D_T = 0x00004000,
	/**
	 * 助词 助语素
	 */
	D_U = 0x00002000,
	/**
	 * 动词 动语素
	 */
	D_V = 0x00001000,

	// ---

	/**
	 * 标点符号
	 */
	D_W = 0x00000800,
	/**
	 * 非语素字
	 */
	D_X = 0x00000400,
	/**
	 * 语气词 语气语素
	 */
	D_Y = 0x00000200,
	/**
	 * 状态词
	 */
	D_Z = 0x00000100,

	// ---

	/**
	 * 人名
	 */
	A_NR = 0x00000080,
	/**
	 * 地名
	 */
	A_NS = 0x00000040,
	/**
	 * 机构团体
	 */
	A_NT = 0x00000020,
	/**
	 * 外文字符
	 */
	A_NX = 0x00000010,

	// ---

	/**
	 * 其他专名
	 */
	A_NZ = 0x00000008,
	/**
	 * 前接成分
	 */
	D_ZH = 0x00000004,
	/**
	 * 后接成分
	 */
	D_K = 0x00000002,
	/**
	 * 网址、邮箱地址
	 */
	URL = 0x00000001,

	/**
	 * 未知词性
	 */
	UNK = 0x00000000,
}

export default POSTAG;
