/**
 * 单词类型
 */
export declare enum POSTAG {
    /**
     * 錯字
     */
    BAD = 2147483648,
    /**
     * 形容词 形语素
     */
    D_A = 1073741824,
    /**
     * 区别词 区别语素
     */
    D_B = 536870912,
    /**
     * 连词 连语素
     */
    D_C = 268435456,
    /**
     * 副词 副语素
     */
    D_D = 134217728,
    /**
     * 叹词 叹语素
     */
    D_E = 67108864,
    /**
     * 方位词 方位语素
     */
    D_F = 33554432,
    /**
     * 成语
     */
    D_I = 16777216,
    /**
     * 习语
     * 類似成語或者曖昧無法分明的用語
     */
    D_L = 8388608,
    /**
     * 数词 数语素
     * 可以與其他數詞或者量詞合併的詞
     */
    A_M = 4194304,
    /**
     * 数量词
     */
    D_MQ = 2097152,
    /**
     * 名词 名语素
     */
    D_N = 1048576,
    /**
     * 拟声词
     */
    D_O = 524288,
    /**
     * 介词
     */
    D_P = 262144,
    /**
     * 量词 量语素
     * 可以與數詞合併的詞
     */
    A_Q = 131072,
    /**
     * 代词 代语素
     */
    D_R = 65536,
    /**
     * 处所词
     */
    D_S = 32768,
    /**
     * 时间词
     */
    D_T = 16384,
    /**
     * 助词 助语素
     */
    D_U = 8192,
    /**
     * 动词 动语素
     */
    D_V = 4096,
    /**
     * 标点符号
     */
    D_W = 2048,
    /**
     * 非语素字
     */
    D_X = 1024,
    /**
     * 语气词 语气语素
     */
    D_Y = 512,
    /**
     * 状态词
     */
    D_Z = 256,
    /**
     * 人名
     */
    A_NR = 128,
    /**
     * 地名
     */
    A_NS = 64,
    /**
     * 机构团体
     */
    A_NT = 32,
    /**
     * 外文字符
     */
    A_NX = 16,
    /**
     * 其他专名
     */
    A_NZ = 8,
    /**
     * 前接成分
     */
    D_ZH = 4,
    /**
     * 后接成分
     */
    D_K = 2,
    /**
     * 网址、邮箱地址
     */
    URL = 1,
    /**
     * 未知词性
     */
    UNK = 0
}
export default POSTAG;
