/**
 * Created by user on 2019/4/12.
 */

import tests_lazy_index from './lazy.index';
import { sortTests } from '../lib/util';

export const tests_fixme_base: typeof tests_lazy_index['tests_lazy_base'] = [

	[
		'被大人版的月大人以公主抱抱著',
		[
			'公主抱',
			'抱著',
		]
	],

	[
		'然後是境界山脈內部全體表示范達魯擁有影響力的地區全區的國名',
		[
			['全體表示', '表示',],
		]
	],

	[
		'在山國里長大的男生三人大概沒見過吧',
		[
			'長大',
		]
	],

	[
		'仍有几處在几小時後繼續施工的工程',
		[
			'幾處',
			'幾小時',
		]
	],

	[
		'但也有普通的日子里表现出气冲冲样子的时候',
		[
			'气沖沖',
		]
	],

	[
		'想要将一切饮干的贪慾的恶意',
		[
			'饮乾',
		]
	],

	[
		'于錯綜複雜的基礎上誕生出現在的羅迪斯王家',
		[
			'現在',
		]
	],

];

export const tests_fixme_base_not: typeof tests_lazy_index['tests_lazy_base_not'] = [

	[
		'由於領民間產生不小的騷動',
		[
			'民間',
		]
	],

	[
		'到湖中間后手終於能休息了',
		[
			['后手', '後手'],
		],
	],

	[
		'被卷入山崩的人中沒有發現生存者',
		[
			'人中',
		],
	],

	[
		'你的待遇是以后再做決定的事情',
		[
			'是以',
		]
	],


	[
		'艾蓮娜有時間的話不要值班准備料理嗎',
		[
			'備料',
		]
	],

	[
		'說出來只會被當做無稽之談',
		[
			'會被',
		]
	],


	[
		'民兵團團長和其他托魯森的男人都明里暗里露出了不滿的表情',
		[
			'團團',
		]
	],

];

export const tests_fixme_array: typeof tests_lazy_index['tests_lazy_array'] = [

];

export const tests_fixme_indexof: typeof tests_lazy_index['tests_lazy_indexof'] = [

	[
		'在看到他的身影后',
		[
			'後',
		],
	],

	[
		'溫室里長大',
		[
			'裡',
		],
	],

	[
		'月光灑落在一把長長的黑发上',
		[
			'髮',
		],
	],

	[
		'他對于月',
		[
			'於',
		],
	],

	[
		'是看起來很困的愛莉絲',
		[
			'睏',
		],
	],

	[
		'亞歷山大把髒了的下巴用脏的餐巾擦了起來',
		[
			'用髒的',
		],
	],

	[
		'只會落到后手',
		[
			'後',
		],
	],

	[
		'就這麼干吧',
		[
			'幹',
		],
	],

	[
		'好像剛到學園的時候我就開始干著鐵匠活了',
		[
			'幹',
		],
	],


	[
		'當然這都是后話了',
		[
			'後',
		],
	],

	[
		'只是照他們要求的干而已',
		[
			'幹',
		],
	],

	[
		'看到她沒干的頭髮粘在她鎖骨上的光景',
		[
			'乾',
		],
	],

	[
		'說不定會被里伊氏族察覺到',
		[
			'里',
		],
	],

	[
		'至于武器',
		[
			'於',
		],
	],

	[
		'干她就對了',
		[
			'幹',
		],
	],

	[
		'干這一行的基本都是大公會的人',
		[
			'幹',
		],
	],

	[
		'本來行會不會發佈這種任務',
		[
			'公會',
		],
	],

	[
		'伊莉娜凝視那樣的夏倫的后影',
		[
			'後',
		],
	],

	[
		'作為父親后妻的女人是和親生母親不變的存在',
		[
			'後',
		],
	],

	[
		'那些注入全身的力量還是讓它的身體略微往后傾',
		[
			'後',
		],
	],


	[
		'夏倫甚麼牢騷都沒发也沒把伊莉娜的手撥開',
		[
			'發',
		],
	],

	[
		'七人里有五人和遙遠的回廊有關聯',
		[
			'裡',
		],
	],

	[
		'男人穿著有點脏的皮甲從中露出的衣服也絕對說不上好',
		[
			'髒',
		],
	],

	[
		'這些都是后話了',
		[
			'後',
		],
	],

	[
		'但手中的雙劍在他松手後掉在地上',
		[
			'鬆',
		],
	],

	[
		'會有益于加華特商的莫大利潤和南部地區巨大信用的話',
		[
			'於',
		],
	],

	[
		'上次大會的准優勝者',
		[
			'準',
		],
	],

	[
		'但是轉過頭來卻发現眼前站著的人和那些男人不同',
		[
			'發',
		],
	],

	[
		'之後的第四場比賽也沒有发生意外',
		[
			'發',
		],
	],

	[
		'不要发小孩子脾氣',
		[
			'發',
		],
	],

	[
		'在伯納士知道的人里恐怕只有伊莉娜能完全躲開了',
		[
			'裡',
		],
	],

	[
		'眼前的屍體已經變成了像干物一樣乾巴巴的',
		[
			'乾物',
		],
	],

	[
		'那就干給你看吧',
		[
			'幹',
		],
	],

	[
		'血什么的一滴都沒喝',
		[
			'麼',
		],
	],


];

sortTests(tests_fixme_base);
sortTests(tests_fixme_base_not);
sortTests(tests_fixme_array);
sortTests(tests_fixme_indexof);

export default exports as typeof import('./fixme.data');
