/**
 * Created by user on 2020/1/17.
 */

import { lazyMatchNot } from '../../lib/util';

/**
 * 分析後不應該存在符合以下結果
 */
export const tests_lazy_base_not: [string, Parameters<typeof lazyMatchNot>['1'], Parameters<typeof lazyMatchNot>['2']?][] = [

	[
		'這份毫不守舊的率直',
		[
			'份毫',
		],
	],

	[
		'在外面放哨的大概有十來人',
		[
			'在外',
		]
	],

	[
		'正是這份工作的不二人選',
		[
			'份工',
		],
	],


	[
		'好像是有商人為了攬客正大聲吆喝著',
		[
			'正大',
		],
	],

	[
		'比起《水月迷宮》中出現的哥布林身體能力有若干的提高',
		[
			'體能',
			['干的', '幹的', '乾的'],
		],
	],

	[
		'所以来办一场上梁仪式吧',
		[
			'以来',
		],
	],

	[
		'莉法娜发出沒力的聲音',
		[
			'出沒',
		],
	],

	[
		'伯納士坐在馬車的御馬台上緊緊攥著繮繩',
		[
			'上緊',
		],
	],

	[
		'每個桌子邊都有數名手拿酒翁的女性等候在一旁',
		[
			'名手',
		],
	],

	[
		'舌头互相交缠的淫秽声响静静地传了出来',
		[
			'相交',
		],
	],

	[
		'《寂靜領域》的發動和操作最好不要依賴聲音',
		[
			'好不',
		],
	],

	[
		'卻奇怪的很講義氣',
		[
			'講義',
		],
	],

	[
		'N在抵達異世界的數天后',
		[
			'天后',
		],
	],


	[
		'只要用對方法說不定就能無人犧牲',
		[
			'對方',
		],
	],

	[
		'在學院潛心于古今魔術的研究',
		[
			'在學',
		],
	],

	[
		'如果說卡麗婭各處所營造出的舉止和氛圍是高貴的話',
		[
			'處所',
		],
	],

	[
		'被占領了',
		[
			['被占', '被佔'],
		],
	],

	[
		'兩個人像浮屍一樣浮上了水面時競技也已經結束了',
		[
			['人像'],
		],
	],

	[
		'我用手里長劍與哥布林交手',
		[
			['里長'],
		],
	],

	[
		'魚如果干巴巴的',
		[
			['果干','果乾'],
		],
	],

	[
		'馬虎的发起兵糧飼草的採購及武器的護理等，也會產生各種各樣麻煩的費用。',
		[
			'起兵',
		],
	],

	[
		'在我把買來的炒面面包吞下去的時候',
		[
			'面面',
		],
	],

	[
		'她准備齊全地待在起居室等待──早起的理由則被她含糊帶過，說什麼也不肯告訴我。',
		[
			['備齊']
		],
	],

	[
		'柔荑掩嘴這一舉止的優雅應該值得世間所有的淑女學習吧。',
		[
			['一舉',],
		],
	],

	[
		'迪亚困倦地揉着眼睛走了过来。',
		[
			['着眼',],
		],
	],

	[
		'「啊，那可糟了。圖書室根本不通融。即使遲到一秒，別人就會佔掉座位了。」',
		[
			['不通',],
		],
	],

	[
		'在那個領域裡，魔族的核實體化了，肉體的分解·再構成變得不能。」',
		[
			['核實',],
		],
	],

	[
		'一邊看著熟睡在沙发上的夏緹亞',
		[
			['发上','發上']
		],
	],

	[
		'百合繪的異常性就浮現出來了',
		[
			['浮現出',],
		],
	],

	[
		'言簡而意賅，媽媽的意圖我已了然於心。',
		[
			['然於']
		],
	],

	[
		'所以並不想合作到這種地步。',
		[
			['種地']
		],
	],

	[
		'廣瀨的下一個對象是我嗎？很遺憾，對男人沒有興趣。',
		[
			['象是']
		],
	],

	[
		'　墮入絕望的深淵的她，最後抓住的對象是――',
		[
			['象是']
		],
	],

	[
		'「唔⋯⋯于南天邊境尋光⋯⋯發行・輝石龕燈！」',
		[
			'天邊',
		],
	],

	[
		'「⋯⋯唉，汝那胡來的惡習還是一如以往吶。若是引起『變異性休克』而死，那可怎麼辦？大蠢材。」',
		[
			'異性',
		],
	],

	[
		'我們也該做出发的準備了嗎？',
		[
			'做出',
		],
	],

	[
		'一整天做出发的準備、隔天早上、一行人從迷宮都市出發了。',
		[
			'做出',
		],
	],

	[
		'他將身體靠在稍遠處的粗大樹干上',
		[
			'大樹',
		],
	],

	[
		'對于越過巴特拉姆攻來的灰衣人們',
		[
			'于越',
		],
	],

	[
		'阿一並沒有回答',
		[
			['一並', '一併'],
		],
	],

	[
		'簡單一句話',
		[
			['單一', '單一句話'],
		],
	],

	[
		'簡單一句話',
		[
			['句話'],
		],
	],

	[
		'消滅旋殻大海龜后',
		[
			['大海'],
		],
	],

	[
		'差點就把自己最重要的部分于大庭廣眾之下大公開了。',
		[
			['大公'],
		],
	],

	[
		'但我不可能忘記那個城鎮的事情還有幸存下來的你',
		[
			['有幸'],
		],
	],

	[
		'記得之前教科書移除了几篇魯迅的文章，現在大概沒有了。）',
		[
			['除了'],
		],
	],

	[
		'「哼，敵臨于前卻連戰意都保持不了⋯⋯⋯所以說你們都是雜魚啊」',
		[
			['連戰'],
		],
	],

	[
		'“……竟然还有幸存的吸血鬼吗？”',
		[
			['有幸'],
		],
	],

	[
		'但真正的意图果然应该是想要为处理掉雷欧制造出借口',
		[
			['出借'],
		],
	],

	[
		'打磨骨头是雷欧尼斯的一大业余爱好。',
		[
			['大业'],
		],
	],

	[
		'「我对『素子』的生活方式抱持过数次疑问',
		[
			['过数'],
		],
	],

];

export default tests_lazy_base_not
